---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTableIterator.Reset
source: html/f2a50821-e2f0-f4df-78e3-78b69e980f7b.htm
---
# Autodesk.Revit.DB.ExportFontTableIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```